Repository: egoist945402376/CDIDEMO
Catalog: tropiconnect/locale/*/LC_MESSAGES/django.po
Languages: sw

source: Home
sw: Nyumbani

source: For Farmers
sw: Ingia kama Mkulima

source: For Buyers
sw: Kwa Wanunuzi

source: About Us
sw: Kuhusu Sisi

source: Contact
sw: Mawasiliano

source: Buyer Login
sw: Ingia kama Mkulima

source: Access your TropiConnect buyer account
sw: Fikia akaunti yako ya mkulima ya TropiConnect

source: Username
sw: Jina la mtumiaji

source: Enter your username
sw: Weka jina lako la mtumiaji

source: Password
sw: Nenosiri

source: Enter your password
sw: Weka nenosiri lako

source: Company Name
sw: Jina la Kampuni

source: Your company name
sw: Jina lako la mwisho

source: Remember me
sw: Nikumbuke

source: Login
sw: Ingia

source: Don't have an account?
sw: Huna akaunti?

source: Register here
sw: Jisajili hapa

source: &copy; 2025 TropiConnect. All Rights Reserved
sw: TropiConnect. Haki Zote Zimehifadhiwa

source: Dashboard
sw: Dashibodi

source: Logout
sw: Toka

source: Edit
sw: Hariri

source: Email:
sw: Barua pepe:

source: Phone:
sw: Simu:

source: Member Since:
sw: Mwanachama Tangu:

source: Edit Info
sw: Hariri Taarifa

source: You haven't added your bio yet. Tell buyers about yourself, your farming practices, and what makes your produce special.
sw: Hujaongeza wasifu wako bado. Waambie wanunuzi kuhusu wewe, mbinu zako za kilimo, na kile kinachofanya mazao yako yawe ya kipekee.

source: Add Farm
sw: Ongeza Shamba

source: Previous
sw: Iliyotangulia

source: Next
sw: Inayofuata

source: Established:
sw: Ilianzishwa:

source: Add Photos
sw: Ongeza Picha

source: You haven't added any farms yet. Add your first farm to showcase your operations to potential buyers.
sw: Hujaongeza shamba lolote bado. Ongeza shamba lako la kwanza kuonyesha shughuli zako kwa wanunuzi watarajiwa.

source: Issuing Organization
sw: Shirika Lililoitoa

source: Issue Date
sw: Tarehe ya Kutolewa

source: Expiry Date
sw: Tarehe ya Kuisha

source: Status
sw: Hali

source: No Expiry
sw: Haina Mwisho

source: Valid
sw: Halali

source: Expired
sw: Imeisha muda

source: You haven't added any certifications yet. Adding certifications can increase buyers' trust in your products.
sw: Hujaongeza vyeti vyovyote bado. Kuongeza vyeti kunaweza kuongeza imani ya wanunuzi katika bidhaa zako.

source: Add Your First Certification
sw: Ongeza Cheti Chako cha Kwanza

source: Photo
sw: Picha

source: Category
sw: Kategoria

source: Description
sw: Maelezo

source: Available
sw: Inapatikana

source: Unavailable
sw: Haipatikani

source: You haven't added any products yet. Add your products to attract potential buyers.
sw: Hujaongeza bidhaa zozote bado. Ongeza bidhaa zako ili kuvutia wanunuzi watarajiwa.

source: Add Your First Product
sw: Ongeza Bidhaa Yako ya Kwanza

source: Update Photo
sw: Sasisha Picha

source: My Communities
sw: Jamii Zangu

source: Communities I Created
sw: Jamii Nilizounda

source: Creator
sw: Muundaji

source: Manage
sw: Simamia

source: Communities I Joined
sw: Jamii Nilizojiunga Nazo

source: View
sw: Angalia

source: You haven't joined or created any communities yet. Communities help farmers collaborate, share knowledge, and attract buyers as a group.
sw: Hujaunda au kujiunga na jamii yoyote bado. Jamii husaidia wakulima kushirikiana, kubadilishana maarifa, na kuvutia wanunuzi kama kikundi.

source: Create Your First Community
sw: Unda Jamii Yako ya Kwanza

source: Total
sw: Jumla

source: Transaction Details:
sw: Maelezo ya Muamala:

source: Quantity:
sw: Kiasi:

source: Price:
sw: Bei:

source: View All Reviews
sw: Angalia Tathmini Zote

source: You haven't received any reviews from buyers yet. Reviews will appear here once buyers rate your products and services.
sw: Hujapokea tathmini zozote kutoka kwa wanunuzi bado. Tathmini zitaonekana hapa mara tu wanunuzi watakapopima bidhaa na huduma zako.

source: Language
sw: Lugha

source: Farmer Login
sw: Ingia kama Mkulima

source: Access your TropiConnect farmer account
sw: Fikia akaunti yako ya mkulima ya TropiConnect

source: First Name
sw: Jina la Kwanza

source: Your first name
sw: Jina lako la kwanza

source: Last Name
sw: Jina la Mwisho

source: Your last name
sw: Jina lako la mwisho

source: All Rights Reserved
sw: Haki Zote Zimehifadhiwa

source: Supply Chain
sw: Mnyororo wa Ugavi

source: Solutions
sw: Suluhisho

source: Login as Farmer
sw: Ingia kama Mkulima

source: Login as Buyer
sw: Ingia kama Mnunuzi

source: TropiConnect: Connecting African Farmers to Global Markets
sw: TropiConnect: Kuunganisha Wakulima wa Afrika na Masoko ya Dunia

source: Bridging the gap between African agricultural producers and worldwide buyers through sustainable, transparent supply chains.
sw: Kuziba pengo kati ya wazalishaji wa kilimo wa Afrika na wanunuzi duniani kote kupitia minyororo ya ugavi endelevu na ya uwazi.

source: Register Now As Farmer
sw: Jisajili Sasa Kama Mkulima

source: Register Now As Buyer
sw: Jisajili Sasa Kama Mnunuzi

source: How TropiConnect Works
sw: Jinsi TropiConnect Inavyofanya Kazi

source: Farmer Connection
sw: Muunganisho wa Wakulima

source: We partner with small-scale farmers across Africa, providing them with resources, training, and direct access to international markets for their high-quality produce.
sw: Tunashirikiana na wakulima wadogo kote Afrika, kuwapatia rasilimali, mafunzo, na ufikiaji wa moja kwa moja kwa masoko ya kimataifa kwa mazao yao bora.

source: Sustainable Practices
sw: Mbinu Endelevu

source: Our platform promotes environmentally friendly farming methods and fair trade principles, ensuring ethical sourcing and sustainable agricultural development.
sw: Jukwaa letu linatangaza mbinu za kilimo rafiki kwa mazingira na kanuni za biashara ya haki, kuhakikisha upatikanaji wa kimaadili na maendeleo endelevu ya kilimo.

source: Global Marketplace
sw: Soko la Dunia

source: Connect directly with verified farmers, browse products by region or type, and establish long-term relationships with reliable agricultural producers from across Africa.
sw: Unganisha moja kwa moja na wakulima waliothibitishwa, vinjari bidhaa kwa kanda au aina, na uanzishe mahusiano ya muda mrefu na wazalishaji wa kilimo wa kuaminika kutoka kote Afrika.

source: African Countries
sw: Nchi za Afrika

source: Income Increase for Farmers
sw: Ongezeko la Kipato kwa Wakulima

source: Global Buyers
sw: Wanunuzi wa Dunia

source: Join Our Global Agricultural Marketplace
sw: Jiunge na Soko Letu la Kilimo la Dunia

source: Whether you're a buyer seeking quality African produce or a farmer looking to reach international markets, TropiConnect brings you together.
sw: Iwe wewe ni mnunuzi unayetafuta mazao bora ya Kiafrika au mkulima anayetaka kufikia masoko ya kimataifa, TropiConnect inakuunganisha pamoja.

source: Connecting African farmers with global markets through transparent supply chains, fair trade practices, and sustainable agricultural partnerships.
sw: Kuunganisha wakulima wa Afrika na masoko ya dunia kupitia minyororo ya ugavi yenye uwazi, mazoea ya biashara ya haki, na ushirikiano wa kilimo endelevu.

source: Browse Products
sw: Vinjari Bidhaa

source: Meet Our Farmers
sw: Kutana na Wakulima Wetu

source: Bulk Ordering
sw: Kuagiza kwa Wingi

source: Seasonal Calendar
sw: Kalenda ya Misimu

source: Join Our Network
sw: Jiunge na Mtandao Wetu

source: Training Resources
sw: Rasilimali za Mafunzo

source: Certification Help
sw: Msaada wa Uthibitisho

source: Success Stories
sw: Hadithi za Mafanikio

source: Contact Us
sw: Wasiliana Nasi

source: Buyer Registration
sw: Usajili wa Mnunuzi

source: Connect with African farmers and source quality agricultural products
sw: Unganisha na wakulima wa Afrika na pata bidhaa za kilimo zenye ubora

source: Account Information
sw: Taarifa za Akaunti

source: Contact Email
sw: Barua pepe ya Mawasiliano

source: Your password must be 8+ characters and can't be entirely numeric.
sw: Nenosiri lako lazima liwe na herufi 8+ na haliwezi kuwa na namba pekee.

source: Company Information
sw: Taarifa za Kampuni

source: Country
sw: Nchi

source: City
sw: Mji

source: Product Interests
sw: Maslahi ya Bidhaa

source: Introduction & Product Interests
sw: Utangulizi & Maslahi ya Bidhaa

source: Your introduction will help us match you with suitable farmers. Be specific about product categories, quality requirements, and typical order volumes.
sw: Utangulizi wako utatusaidia kukupatanisha na wakulima wanaofaa. Eleza kuhusu aina za bidhaa, mahitaji ya ubora, na wingi wa agizo la kawaida.

source: I agree to TropiConnect's
sw: Nakubaliana na Masharti ya Huduma ya TropiConnect

source: Terms of Service
sw: Masharti ya Huduma

source: and
sw: na

source: Privacy Policy
sw: na Sera ya Faragha

source: Create Buyer Account
sw: Fungua Akaunti ya Mnunuzi

source: Already have an account?
sw: Huna akaunti?

source: Sign in
sw: Lugha

source: TropiConnect. All Rights Reserved
sw: TropiConnect. Haki Zote Zimehifadhiwa

source: Join our network of African farmers and access global markets
sw: TropiConnect: Kuunganisha Wakulima wa Afrika na Masoko ya Dunia

source: Email Address
sw: Anwani ya Barua Pepe

source: Phone Number
sw: Namba ya Simu

source: TropiConnect Home page
sw: Ukurasa wa Nyumbani wa TropiConnect
